'''
문제
I(세 자리 수) × (세 자리 수)는 다음과 같은 과정을 통하여 이루어진다.

(1)과 (2)위치에 들어갈 세 자리 자연수가 주어질 때 (3), (4), (5), (6)위치에 들어갈 값을 구하는 프로그램을 작성하시오.

입력
첫째 줄에 (1)의 위치에 들어갈 세 자리 자연수가, 둘째 줄에 (2)의 위치에 들어갈 세자리 자연수가 주어진다.

출력
첫째 줄부터 넷째 줄까지 차례대로 (3), (4), (5), (6)에 들어갈 값을 출력한다.

예제)
입력
472
385

출력
2360
3776
1416
181720
'''
a = int(input()) # (1)
b = input() # (2)

def multiThree(a,b):
    # (3) 위치 : (1) x (2)의 일의자리와 곱
    print(a * int(b[len(b)-1]))
    # (4) 위치 : (1) x (2)의 십의자리와 곱
    print(a * int(b[len(b)-2]))
    # (5) 위치 : (1) x (2)의 백의자리와 곱
    print(a * int(b[0]))
    # (6) 위치 : (1) x (2)
    print(a * int(b))

multiThree(a,b)

